INSERT INTO stage.klienti (customer_id, subname, name, phone_number, city, Registrated_date)
VALUES
(1,'CUS001','Иванов Иван','+79000000001','Москва','2024-01-10'),
(2,'CUS002','Петров Пётр','+79000000002','Москва','2024-02-12'),
(3,'CUS003','Сидоров Алексей','+79000000003','Санкт-Петербург','2024-03-05'),
(4,'CUS004','Кузнецов Олег','+79000000004','Самара','2024-01-15'),
(5,'CUS005','Попова Анна','+79000000005','Казань','2024-02-20'),
(6,'CUS006','Васильев Дмитрий','+79000000006','Москва','2024-03-11'),
(7,'CUS007','Смирнова Мария','+79000000007','Самара','2024-04-01'),
(8,'CUS008','Волков Андрей','+79000000008','Казань','2024-01-25'),
(9,'CUS009','Фёдорова Елена','+79000000009','Москва','2024-02-14'),
(10,'CUS010','Морозов Сергей','+79000000010','Санкт-Петербург','2024-02-18');

DECLARE @i INT = 11;

WHILE @i <= 50
BEGIN
    INSERT INTO stage.klienti
    VALUES (
        @i,
        CONCAT('CUS',FORMAT(@i,'000')),
        CONCAT('Клиент_',@i),
        CONCAT('+79000000',FORMAT(@i,'000')),
        CHOOSE((@i % 5)+1,'Москва','Санкт-Петербург','Самара','Казань','Новосибирск'),
        DATEADD(DAY,-@i,GETDATE())
    );
    SET @i+=1;
END;